AmbiqAI/neuralSPOT/extern/AmbiqSuite/R5.2.alpha.1.1/mcu/apollo510L/regs/am_mcu_apollo510L_otpinfo1.h
//*****************************************************************************
//
//  am_mcu_apollo510l_otpinfo1.h
//
//*****************************************************************************

//*****************************************************************************
//
// Copyright (c) 2025, Ambiq Micro, Inc.
// All rights reserved.
//
// Redistribution and use in source and binary forms, with or without
// modification, are permitted provided that the following conditions are met:
//
// 1. Redistributions of source code must retain the above copyright notice,
// this list of conditions and the following disclaimer.
//
// 2. Redistributions in binary form must reproduce the above copyright
// notice, this list of conditions and the following disclaimer in the
// documentation and/or other materials provided with the distribution.
//
// 3. Neither the name of the copyright holder nor the names of its
// contributors may be used to endorse or promote products derived from this
// software without specific prior written permission.
//
// Third party software included in this distribution is subject to the
// additional license terms as defined in the /docs/licenses directory.
//
// THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
// AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
// IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
// ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE
// LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
// CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
// SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
// INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
// CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
// ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
// POSSIBILITY OF SUCH DAMAGE.
//
// This is part of revision release_sdk5_2_a_1_1-c2486c8ef of the AmbiqSuite Development Package.
//
//*****************************************************************************

#ifndef AM_REG_OTP_INFO1_H
#define AM_REG_OTP_INFO1_H

#define AM_REG_OTP_INFO1_BASEADDR 0x42006000

#define AM_REG_OTP_INFO1_MRAM_RCVY_CNT0_O 0x00000800
#define AM_REG_OTP_INFO1_MRAM_RCVY_CNT0_ADDR 0x42006800
#define AM_REG_OTP_INFO1_MRAM_RCVY_CNT1_O 0x00000804
#define AM_REG_OTP_INFO1_MRAM_RCVY_CNT1_ADDR 0x42006804
#define AM_REG_OTP_INFO1_MAINPTR_O 0x00000810
#define AM_REG_OTP_INFO1_MAINPTR_ADDR 0x42006810
#define AM_REG_OTP_INFO1_SBLOTA_O 0x00000818
#define AM_REG_OTP_INFO1_SBLOTA_ADDR 0x42006818
#define AM_REG_OTP_INFO1_SOCID0_O 0x00000820
#define AM_REG_OTP_INFO1_SOCID0_ADDR 0x42006820
#define AM_REG_OTP_INFO1_SOCID1_O 0x00000824
#define AM_REG_OTP_INFO1_SOCID1_ADDR 0x42006824
#define AM_REG_OTP_INFO1_SOCID2_O 0x00000828
#define AM_REG_OTP_INFO1_SOCID2_ADDR 0x42006828
#define AM_REG_OTP_INFO1_SOCID3_O 0x0000082c
#define AM_REG_OTP_INFO1_SOCID3_ADDR 0x4200682c
#define AM_REG_OTP_INFO1_SOCID4_O 0x00000830
#define AM_REG_OTP_INFO1_SOCID4_ADDR 0x42006830
#define AM_REG_OTP_INFO1_SOCID5_O 0x00000834
#define AM_REG_OTP_INFO1_SOCID5_ADDR 0x42006834
#define AM_REG_OTP_INFO1_SOCID6_O 0x00000838
#define AM_REG_OTP_INFO1_SOCID6_ADDR 0x42006838
#define AM_REG_OTP_INFO1_SOCID7_O 0x0000083c
#define AM_REG_OTP_INFO1_SOCID7_ADDR 0x4200683c
#define AM_REG_OTP_INFO1_PATCH_TRACKER0_O 0x00000840
#define AM_REG_OTP_INFO1_PATCH_TRACKER0_ADDR 0x42006840
#define AM_REG_OTP_INFO1_PATCH_TRACKER1_O 0x00000844
#define AM_REG_OTP_INFO1_PATCH_TRACKER1_ADDR 0x42006844
#define AM_REG_OTP_INFO1_PATCH_TRACKER2_O 0x00000848
#define AM_REG_OTP_INFO1_PATCH_TRACKER2_ADDR 0x42006848
#define AM_REG_OTP_INFO1_PATCH_TRACKER3_O 0x0000084c
#define AM_REG_OTP_INFO1_PATCH_TRACKER3_ADDR 0x4200684c
#define AM_REG_OTP_INFO1_SBR_SDCERT_ADDR_O 0x00000850
#define AM_REG_OTP_INFO1_SBR_SDCERT_ADDR_ADDR 0x42006850
#define AM_REG_OTP_INFO1_SBR_IPT_ADDR_O 0x00000858
#define AM_REG_OTP_INFO1_SBR_IPT_ADDR_ADDR 0x42006858
#define AM_REG_OTP_INFO1_SBR_OPT_ADDR_O 0x0000085c
#define AM_REG_OTP_INFO1_SBR_OPT_ADDR_ADDR 0x4200685c
#define AM_REG_OTP_INFO1_TRIM_SBR_OTP_O 0x00000860
#define AM_REG_OTP_INFO1_TRIM_SBR_OTP_ADDR 0x42006860
#define AM_REG_OTP_INFO1_EXTIMGCERTADDR0_O 0x00000864
#define AM_REG_OTP_INFO1_EXTIMGCERTADDR0_ADDR 0x42006864
#define AM_REG_OTP_INFO1_EXTIMGCERTADDR1_O 0x00000868
#define AM_REG_OTP_INFO1_EXTIMGCERTADDR1_ADDR 0x42006868
#define AM_REG_OTP_INFO1_EXTIMGCERTADDR2_O 0x0000086c
#define AM_REG_OTP_INFO1_EXTIMGCERTADDR2_ADDR 0x4200686c
#define AM_REG_OTP_INFO1_EXTIMGCERTADDR3_O 0x00000870
#define AM_REG_OTP_INFO1_EXTIMGCERTADDR3_ADDR 0x42006870
#define AM_REG_OTP_INFO1_TEMP_CAL_ATE_O 0x00000900
#define AM_REG_OTP_INFO1_TEMP_CAL_ATE_ADDR 0x42006900
#define AM_REG_OTP_INFO1_TEMP_CAL_MEASURED_O 0x00000904
#define AM_REG_OTP_INFO1_TEMP_CAL_MEASURED_ADDR 0x42006904
#define AM_REG_OTP_INFO1_TEMP_CAL_ADC_OFFSET_O 0x00000908
#define AM_REG_OTP_INFO1_TEMP_CAL_ADC_OFFSET_ADDR 0x42006908
#define AM_REG_OTP_INFO1_CHIPSUBREV_O 0x0000090c
#define AM_REG_OTP_INFO1_CHIPSUBREV_ADDR 0x4200690c
#define AM_REG_OTP_INFO1_TRIM_REV_O 0x00000910
#define AM_REG_OTP_INFO1_TRIM_REV_ADDR 0x42006910
#define AM_REG_OTP_INFO1_FT1_GDR1_O 0x00000914
#define AM_REG_OTP_INFO1_FT1_GDR1_ADDR 0x42006914
#define AM_REG_OTP_INFO1_FT2_GDR1_O 0x00000918
#define AM_REG_OTP_INFO1_FT2_GDR1_ADDR 0x42006918
#define AM_REG_OTP_INFO1_LVT_TRIMCODE_O 0x0000091c
#define AM_REG_OTP_INFO1_LVT_TRIMCODE_ADDR 0x4200691c
#define AM_REG_OTP_INFO1_EHVT_TRIMCODE_O 0x00000920
#define AM_REG_OTP_INFO1_EHVT_TRIMCODE_ADDR 0x42006920
#define AM_REG_OTP_INFO1_ADC_GAIN_ERR_O 0x00000928
#define AM_REG_OTP_INFO1_ADC_GAIN_ERR_ADDR 0x42006928
#define AM_REG_OTP_INFO1_ADC_OFFSET_ERR_O 0x0000092c
#define AM_REG_OTP_INFO1_ADC_OFFSET_ERR_ADDR 0x4200692c
#define AM_REG_OTP_INFO1_AUDADC_A0_LG_OFFSET_O 0x00000940
#define AM_REG_OTP_INFO1_AUDADC_A0_LG_OFFSET_ADDR 0x42006940
#define AM_REG_OTP_INFO1_AUDADC_A0_HG_SLOPE_O 0x00000944
#define AM_REG_OTP_INFO1_AUDADC_A0_HG_SLOPE_ADDR 0x42006944
#define AM_REG_OTP_INFO1_AUDADC_A0_HG_INTERCEPT_O 0x00000948
#define AM_REG_OTP_INFO1_AUDADC_A0_HG_INTERCEPT_ADDR 0x42006948
#define AM_REG_OTP_INFO1_AUDADC_A1_LG_OFFSET_O 0x0000094c
#define AM_REG_OTP_INFO1_AUDADC_A1_LG_OFFSET_ADDR 0x4200694c
#define AM_REG_OTP_INFO1_AUDADC_A1_HG_SLOPE_O 0x00000950
#define AM_REG_OTP_INFO1_AUDADC_A1_HG_SLOPE_ADDR 0x42006950
#define AM_REG_OTP_INFO1_AUDADC_A1_HG_INTERCEPT_O 0x00000954
#define AM_REG_OTP_INFO1_AUDADC_A1_HG_INTERCEPT_ADDR 0x42006954
#define AM_REG_OTP_INFO1_AUDADC_B0_LG_OFFSET_O 0x00000958
#define AM_REG_OTP_INFO1_AUDADC_B0_LG_OFFSET_ADDR 0x42006958
#define AM_REG_OTP_INFO1_AUDADC_B0_HG_SLOPE_O 0x0000095c
#define AM_REG_OTP_INFO1_AUDADC_B0_HG_SLOPE_ADDR 0x4200695c
#define AM_REG_OTP_INFO1_AUDADC_B0_HG_INTERCEPT_O 0x00000960
#define AM_REG_OTP_INFO1_AUDADC_B0_HG_INTERCEPT_ADDR 0x42006960
#define AM_REG_OTP_INFO1_AUDADC_B1_LG_OFFSET_O 0x00000964
#define AM_REG_OTP_INFO1_AUDADC_B1_LG_OFFSET_ADDR 0x42006964
#define AM_REG_OTP_INFO1_AUDADC_B1_HG_SLOPE_O 0x00000968
#define AM_REG_OTP_INFO1_AUDADC_B1_HG_SLOPE_ADDR 0x42006968
#define AM_REG_OTP_INFO1_AUDADC_B1_HG_INTERCEPT_O 0x0000096c
#define AM_REG_OTP_INFO1_AUDADC_B1_HG_INTERCEPT_ADDR 0x4200696c
#define AM_REG_OTP_INFO1_RFTRIM_TRIM_VER_O 0x00000970
#define AM_REG_OTP_INFO1_RFTRIM_TRIM_VER_ADDR 0x42006970
#define AM_REG_OTP_INFO1_RFTRIM_XOCONFIG_O 0x00000974
#define AM_REG_OTP_INFO1_RFTRIM_XOCONFIG_ADDR 0x42006974
#define AM_REG_OTP_INFO1_RFTRIM_OSCTRIM_O 0x00000978
#define AM_REG_OTP_INFO1_RFTRIM_OSCTRIM_ADDR 0x42006978
#define AM_REG_OTP_INFO1_RFTRIM_RADIOTUNE_O 0x0000097c
#define AM_REG_OTP_INFO1_RFTRIM_RADIOTUNE_ADDR 0x4200697c
#define AM_REG_OTP_INFO1_POWERSTATE0_O 0x00000a50
#define AM_REG_OTP_INFO1_POWERSTATE0_ADDR 0x42006a50
#define AM_REG_OTP_INFO1_SCM_CNTRCTRL2_O 0x00000a54
#define AM_REG_OTP_INFO1_SCM_CNTRCTRL2_ADDR 0x42006a54
#define AM_REG_OTP_INFO1_SCM_LPTHRESHVDDS_O 0x00000a58
#define AM_REG_OTP_INFO1_SCM_LPTHRESHVDDS_ADDR 0x42006a58
#define AM_REG_OTP_INFO1_SCM_LPTHRESHVDDF_O 0x00000a5c
#define AM_REG_OTP_INFO1_SCM_LPTHRESHVDDF_ADDR 0x42006a5c
#define AM_REG_OTP_INFO1_SCM_LPTHRESHVDDC_O 0x00000a60
#define AM_REG_OTP_INFO1_SCM_LPTHRESHVDDC_ADDR 0x42006a60
#define AM_REG_OTP_INFO1_SCM_LPTHRESHVDDCLV_O 0x00000a64
#define AM_REG_OTP_INFO1_SCM_LPTHRESHVDDCLV_ADDR 0x42006a64
#define AM_REG_OTP_INFO1_SCM_LPTHRESHVDDRF_O 0x00000a68
#define AM_REG_OTP_INFO1_SCM_LPTHRESHVDDRF_ADDR 0x42006a68
#define AM_REG_OTP_INFO1_SCM_LPHYSTCNT_O 0x00000a6c
#define AM_REG_OTP_INFO1_SCM_LPHYSTCNT_ADDR 0x42006a6c
#define AM_REG_OTP_INFO1_SCM_ACTTHRESH1_O 0x00000a70
#define AM_REG_OTP_INFO1_SCM_ACTTHRESH1_ADDR 0x42006a70
#define AM_REG_OTP_INFO1_SCM_ACTTHRESH2_O 0x00000a74
#define AM_REG_OTP_INFO1_SCM_ACTTHRESH2_ADDR 0x42006a74
#define AM_REG_OTP_INFO1_SCM_ACTTHRESH3_O 0x00000a78
#define AM_REG_OTP_INFO1_SCM_ACTTHRESH3_ADDR 0x42006a78

// MRAM_RCVY_CNT0 - A bit count of the number of successful MRAM recoveries that have been done (0-31).  Each set bit equates to a successful MRAM recovery (of the AMBIQ recovery image). The count saturates at 31 = 0xFFFFFFFF (31 bits being set), additional counts (32-63) are logged in MRAM_RCVY_CNT1

// MRAM_RCVY_CNT1 - A bit count of the number of successful MRAM recoveries that have been done (32-64).  Each set bit equates to a successful MRAM recovery (of the AMBIQ recovery image). This field is not used until the MRAM_RCVY_CNT0 has been exhausted (31 = 0xFFFFFFFF), additional counts (32-63) are logged here

// MAINPTR - The location of the vector table of the main program. This value is read-only.
#define AM_REG_OTP_INFO1_MAINPTR_ADDRESS_S 0
#define AM_REG_OTP_INFO1_MAINPTR_ADDRESS_M 0xFFFFFFFF
#define AM_REG_OTP_INFO1_MAINPTR_ADDRESS(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)
#define AM_REG_OTP_INFO1_MAINPTR_ADDRESS_Pos 0
#define AM_REG_OTP_INFO1_MAINPTR_ADDRESS_Msk 0xFFFFFFFF

