AmbiqAI/neuralSPOT/extern/AmbiqSuite/R5.2.alpha.1.1/mcu/apollo510L/regs/am_mcu_apollo510L_otpinfo1.h
// EXTIMGCERTADDR0 - The content certificate address for the validated extended image 0. (CM4 Radio Image Cert Address)  0x0 means unused.
#define AM_REG_OTP_INFO1_EXTIMGCERTADDR0_ADDRESS_S 0
#define AM_REG_OTP_INFO1_EXTIMGCERTADDR0_ADDRESS_M 0xFFFFFFFF
#define AM_REG_OTP_INFO1_EXTIMGCERTADDR0_ADDRESS(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)
#define AM_REG_OTP_INFO1_EXTIMGCERTADDR0_ADDRESS_Pos 0
#define AM_REG_OTP_INFO1_EXTIMGCERTADDR0_ADDRESS_Msk 0xFFFFFFFF

// EXTIMGCERTADDR1 - The content certificate address for the validated extended image 1. 0x0 means unused.
#define AM_REG_OTP_INFO1_EXTIMGCERTADDR1_ADDRESS_S 0
#define AM_REG_OTP_INFO1_EXTIMGCERTADDR1_ADDRESS_M 0xFFFFFFFF
#define AM_REG_OTP_INFO1_EXTIMGCERTADDR1_ADDRESS(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)
#define AM_REG_OTP_INFO1_EXTIMGCERTADDR1_ADDRESS_Pos 0
#define AM_REG_OTP_INFO1_EXTIMGCERTADDR1_ADDRESS_Msk 0xFFFFFFFF

// EXTIMGCERTADDR2 - The content certificate address for the validated extended image 2. 0x0 means unused.
#define AM_REG_OTP_INFO1_EXTIMGCERTADDR2_ADDRESS_S 0
#define AM_REG_OTP_INFO1_EXTIMGCERTADDR2_ADDRESS_M 0xFFFFFFFF
#define AM_REG_OTP_INFO1_EXTIMGCERTADDR2_ADDRESS(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)
#define AM_REG_OTP_INFO1_EXTIMGCERTADDR2_ADDRESS_Pos 0
#define AM_REG_OTP_INFO1_EXTIMGCERTADDR2_ADDRESS_Msk 0xFFFFFFFF

// EXTIMGCERTADDR3 - The content certificate address for the validated extended image 3. 0x0 means unused.
#define AM_REG_OTP_INFO1_EXTIMGCERTADDR3_ADDRESS_S 0
#define AM_REG_OTP_INFO1_EXTIMGCERTADDR3_ADDRESS_M 0xFFFFFFFF
#define AM_REG_OTP_INFO1_EXTIMGCERTADDR3_ADDRESS(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)
#define AM_REG_OTP_INFO1_EXTIMGCERTADDR3_ADDRESS_Pos 0
#define AM_REG_OTP_INFO1_EXTIMGCERTADDR3_ADDRESS_Msk 0xFFFFFFFF

// TEMP_CAL_ATE - The temperature measured on the ATE test head when the part's temperature sensor was calibrated.
#define AM_REG_OTP_INFO1_TEMP_CAL_ATE_TEMPERATURE_S 0
#define AM_REG_OTP_INFO1_TEMP_CAL_ATE_TEMPERATURE_M 0xFFFFFFFF
#define AM_REG_OTP_INFO1_TEMP_CAL_ATE_TEMPERATURE(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)
#define AM_REG_OTP_INFO1_TEMP_CAL_ATE_TEMPERATURE_Pos 0
#define AM_REG_OTP_INFO1_TEMP_CAL_ATE_TEMPERATURE_Msk 0xFFFFFFFF

// TEMP_CAL_MEASURED - The voltage measured on the analog test mux output when the part's temperature sensor was calibrated.
#define AM_REG_OTP_INFO1_TEMP_CAL_MEASURED_VOLTS_S 0
#define AM_REG_OTP_INFO1_TEMP_CAL_MEASURED_VOLTS_M 0xFFFFFFFF
#define AM_REG_OTP_INFO1_TEMP_CAL_MEASURED_VOLTS(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)
#define AM_REG_OTP_INFO1_TEMP_CAL_MEASURED_VOLTS_Pos 0
#define AM_REG_OTP_INFO1_TEMP_CAL_MEASURED_VOLTS_Msk 0xFFFFFFFF

// TEMP_CAL_ADC_OFFSET - The offset voltage measured on for the ADC when the part's temperature sensor was calibrated.
#define AM_REG_OTP_INFO1_TEMP_CAL_ADC_OFFSET_VOLTS_S 0
#define AM_REG_OTP_INFO1_TEMP_CAL_ADC_OFFSET_VOLTS_M 0xFFFFFFFF
#define AM_REG_OTP_INFO1_TEMP_CAL_ADC_OFFSET_VOLTS(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)
#define AM_REG_OTP_INFO1_TEMP_CAL_ADC_OFFSET_VOLTS_Pos 0
#define AM_REG_OTP_INFO1_TEMP_CAL_ADC_OFFSET_VOLTS_Msk 0xFFFFFFFF

// CHIPSUBREV -
#define AM_REG_OTP_INFO1_CHIPSUBREV_SUBREV_S 0
#define AM_REG_OTP_INFO1_CHIPSUBREV_SUBREV_M 0xFFFFFFFF
#define AM_REG_OTP_INFO1_CHIPSUBREV_SUBREV(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)
#define AM_REG_OTP_INFO1_CHIPSUBREV_SUBREV_Pos 0
#define AM_REG_OTP_INFO1_CHIPSUBREV_SUBREV_Msk 0xFFFFFFFF

// TRIM_REV - Contains the trim revision number.
#define AM_REG_OTP_INFO1_TRIM_REV_REVNUM_S 0
#define AM_REG_OTP_INFO1_TRIM_REV_REVNUM_M 0xFFFFFFFF
#define AM_REG_OTP_INFO1_TRIM_REV_REVNUM(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)
#define AM_REG_OTP_INFO1_TRIM_REV_REVNUM_Pos 0
#define AM_REG_OTP_INFO1_TRIM_REV_REVNUM_Msk 0xFFFFFFFF

// FT1_GDR1 - Copy of FT1 GDR1
#define AM_REG_OTP_INFO1_FT1_GDR1_FTVAL_S 0
#define AM_REG_OTP_INFO1_FT1_GDR1_FTVAL_M 0xFFFFFFFF
#define AM_REG_OTP_INFO1_FT1_GDR1_FTVAL(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)
#define AM_REG_OTP_INFO1_FT1_GDR1_FTVAL_Pos 0
#define AM_REG_OTP_INFO1_FT1_GDR1_FTVAL_Msk 0xFFFFFFFF

// FT2_GDR1 - Copy of FT2 GDR1
#define AM_REG_OTP_INFO1_FT2_GDR1_FTVAL_S 0
#define AM_REG_OTP_INFO1_FT2_GDR1_FTVAL_M 0xFFFFFFFF
#define AM_REG_OTP_INFO1_FT2_GDR1_FTVAL(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)
#define AM_REG_OTP_INFO1_FT2_GDR1_FTVAL_Pos 0
#define AM_REG_OTP_INFO1_FT2_GDR1_FTVAL_Msk 0xFFFFFFFF

// LVT_TRIMCODE - LVT trim code value.
#define AM_REG_OTP_INFO1_LVT_TRIMCODE_TRIMCODE_S 0
#define AM_REG_OTP_INFO1_LVT_TRIMCODE_TRIMCODE_M 0xFFFFFFFF
#define AM_REG_OTP_INFO1_LVT_TRIMCODE_TRIMCODE(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)
#define AM_REG_OTP_INFO1_LVT_TRIMCODE_TRIMCODE_Pos 0
#define AM_REG_OTP_INFO1_LVT_TRIMCODE_TRIMCODE_Msk 0xFFFFFFFF

// EHVT_TRIMCODE - EHVT trim code value.
#define AM_REG_OTP_INFO1_EHVT_TRIMCODE_TRIMCODE_S 0
#define AM_REG_OTP_INFO1_EHVT_TRIMCODE_TRIMCODE_M 0xFFFFFFFF
#define AM_REG_OTP_INFO1_EHVT_TRIMCODE_TRIMCODE(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)
#define AM_REG_OTP_INFO1_EHVT_TRIMCODE_TRIMCODE_Pos 0
#define AM_REG_OTP_INFO1_EHVT_TRIMCODE_TRIMCODE_Msk 0xFFFFFFFF

// ADC_GAIN_ERR - This float value is the ADC gain error used for correcting the error from ADC measurement.
#define AM_REG_OTP_INFO1_ADC_GAIN_ERR_ERROR_S 0
#define AM_REG_OTP_INFO1_ADC_GAIN_ERR_ERROR_M 0xFFFFFFFF
#define AM_REG_OTP_INFO1_ADC_GAIN_ERR_ERROR(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)
#define AM_REG_OTP_INFO1_ADC_GAIN_ERR_ERROR_Pos 0
#define AM_REG_OTP_INFO1_ADC_GAIN_ERR_ERROR_Msk 0xFFFFFFFF

// ADC_OFFSET_ERR - This float value is the ADC offset (volts).
#define AM_REG_OTP_INFO1_ADC_OFFSET_ERR_OFFSET_S 0
#define AM_REG_OTP_INFO1_ADC_OFFSET_ERR_OFFSET_M 0xFFFFFFFF
#define AM_REG_OTP_INFO1_ADC_OFFSET_ERR_OFFSET(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)
#define AM_REG_OTP_INFO1_ADC_OFFSET_ERR_OFFSET_Pos 0
#define AM_REG_OTP_INFO1_ADC_OFFSET_ERR_OFFSET_Msk 0xFFFFFFFF

// AUDADC_A0_LG_OFFSET - This is the float value for low gain offset (less than 12dB). A0 maps to Slot 0
#define AM_REG_OTP_INFO1_AUDADC_A0_LG_OFFSET_LGOFFSET_S 0
#define AM_REG_OTP_INFO1_AUDADC_A0_LG_OFFSET_LGOFFSET_M 0xFFFFFFFF
#define AM_REG_OTP_INFO1_AUDADC_A0_LG_OFFSET_LGOFFSET(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)
#define AM_REG_OTP_INFO1_AUDADC_A0_LG_OFFSET_LGOFFSET_Pos 0
#define AM_REG_OTP_INFO1_AUDADC_A0_LG_OFFSET_LGOFFSET_Msk 0xFFFFFFFF

// AUDADC_A0_HG_SLOPE - This is the float value for high gain slope (more than 12dB). A0 maps to Slot 0
#define AM_REG_OTP_INFO1_AUDADC_A0_HG_SLOPE_HGSLOPE_S 0
#define AM_REG_OTP_INFO1_AUDADC_A0_HG_SLOPE_HGSLOPE_M 0xFFFFFFFF
#define AM_REG_OTP_INFO1_AUDADC_A0_HG_SLOPE_HGSLOPE(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)
#define AM_REG_OTP_INFO1_AUDADC_A0_HG_SLOPE_HGSLOPE_Pos 0
#define AM_REG_OTP_INFO1_AUDADC_A0_HG_SLOPE_HGSLOPE_Msk 0xFFFFFFFF

// AUDADC_A0_HG_INTERCEPT - This is the float value for high gain intercept (more than 12dB). A0 maps to Slot 0
#define AM_REG_OTP_INFO1_AUDADC_A0_HG_INTERCEPT_HGINTERCEPT_S 0
#define AM_REG_OTP_INFO1_AUDADC_A0_HG_INTERCEPT_HGINTERCEPT_M 0xFFFFFFFF
#define AM_REG_OTP_INFO1_AUDADC_A0_HG_INTERCEPT_HGINTERCEPT(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)
#define AM_REG_OTP_INFO1_AUDADC_A0_HG_INTERCEPT_HGINTERCEPT_Pos 0
#define AM_REG_OTP_INFO1_AUDADC_A0_HG_INTERCEPT_HGINTERCEPT_Msk 0xFFFFFFFF

