AmbiqAI/neuralSPOT/extern/AmbiqSuite/R5.2.alpha.1.1/mcu/apollo510L/regs/am_mcu_apollo510L_otpinfo1.h
// AUDADC_A1_LG_OFFSET - This is the float value for low gain offset (less than 12dB). A1 maps to Slot 1
#define AM_REG_OTP_INFO1_AUDADC_A1_LG_OFFSET_LGOFFSET_S 0
#define AM_REG_OTP_INFO1_AUDADC_A1_LG_OFFSET_LGOFFSET_M 0xFFFFFFFF
#define AM_REG_OTP_INFO1_AUDADC_A1_LG_OFFSET_LGOFFSET(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)
#define AM_REG_OTP_INFO1_AUDADC_A1_LG_OFFSET_LGOFFSET_Pos 0
#define AM_REG_OTP_INFO1_AUDADC_A1_LG_OFFSET_LGOFFSET_Msk 0xFFFFFFFF

// AUDADC_A1_HG_SLOPE - This is the float value for high gain slope (more than 12dB). A1 maps to Slot 1
#define AM_REG_OTP_INFO1_AUDADC_A1_HG_SLOPE_HGSLOPE_S 0
#define AM_REG_OTP_INFO1_AUDADC_A1_HG_SLOPE_HGSLOPE_M 0xFFFFFFFF
#define AM_REG_OTP_INFO1_AUDADC_A1_HG_SLOPE_HGSLOPE(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)
#define AM_REG_OTP_INFO1_AUDADC_A1_HG_SLOPE_HGSLOPE_Pos 0
#define AM_REG_OTP_INFO1_AUDADC_A1_HG_SLOPE_HGSLOPE_Msk 0xFFFFFFFF

// AUDADC_A1_HG_INTERCEPT - This is the float value for high gain intercept (more than 12dB). A1 maps to Slot 1
#define AM_REG_OTP_INFO1_AUDADC_A1_HG_INTERCEPT_HGINTERCEPT_S 0
#define AM_REG_OTP_INFO1_AUDADC_A1_HG_INTERCEPT_HGINTERCEPT_M 0xFFFFFFFF
#define AM_REG_OTP_INFO1_AUDADC_A1_HG_INTERCEPT_HGINTERCEPT(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)
#define AM_REG_OTP_INFO1_AUDADC_A1_HG_INTERCEPT_HGINTERCEPT_Pos 0
#define AM_REG_OTP_INFO1_AUDADC_A1_HG_INTERCEPT_HGINTERCEPT_Msk 0xFFFFFFFF

// AUDADC_B0_LG_OFFSET - This is the float value for low gain offset (less than 12dB). B0 maps to Slot 2
#define AM_REG_OTP_INFO1_AUDADC_B0_LG_OFFSET_LGOFFSET_S 0
#define AM_REG_OTP_INFO1_AUDADC_B0_LG_OFFSET_LGOFFSET_M 0xFFFFFFFF
#define AM_REG_OTP_INFO1_AUDADC_B0_LG_OFFSET_LGOFFSET(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)
#define AM_REG_OTP_INFO1_AUDADC_B0_LG_OFFSET_LGOFFSET_Pos 0
#define AM_REG_OTP_INFO1_AUDADC_B0_LG_OFFSET_LGOFFSET_Msk 0xFFFFFFFF

// AUDADC_B0_HG_SLOPE - This is the float value for high gain slope (more than 12dB). B0 maps to Slot 2
#define AM_REG_OTP_INFO1_AUDADC_B0_HG_SLOPE_HGSLOPE_S 0
#define AM_REG_OTP_INFO1_AUDADC_B0_HG_SLOPE_HGSLOPE_M 0xFFFFFFFF
#define AM_REG_OTP_INFO1_AUDADC_B0_HG_SLOPE_HGSLOPE(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)
#define AM_REG_OTP_INFO1_AUDADC_B0_HG_SLOPE_HGSLOPE_Pos 0
#define AM_REG_OTP_INFO1_AUDADC_B0_HG_SLOPE_HGSLOPE_Msk 0xFFFFFFFF

// AUDADC_B0_HG_INTERCEPT - This is the float value for high gain intercept (more than 12dB). B0 maps to Slot 2
#define AM_REG_OTP_INFO1_AUDADC_B0_HG_INTERCEPT_HGINTERCEPT_S 0
#define AM_REG_OTP_INFO1_AUDADC_B0_HG_INTERCEPT_HGINTERCEPT_M 0xFFFFFFFF
#define AM_REG_OTP_INFO1_AUDADC_B0_HG_INTERCEPT_HGINTERCEPT(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)
#define AM_REG_OTP_INFO1_AUDADC_B0_HG_INTERCEPT_HGINTERCEPT_Pos 0
#define AM_REG_OTP_INFO1_AUDADC_B0_HG_INTERCEPT_HGINTERCEPT_Msk 0xFFFFFFFF

// AUDADC_B1_LG_OFFSET - This is the float value for low gain offset (less than 12dB). B1 maps to Slot 3
#define AM_REG_OTP_INFO1_AUDADC_B1_LG_OFFSET_LGOFFSET_S 0
#define AM_REG_OTP_INFO1_AUDADC_B1_LG_OFFSET_LGOFFSET_M 0xFFFFFFFF
#define AM_REG_OTP_INFO1_AUDADC_B1_LG_OFFSET_LGOFFSET(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)
#define AM_REG_OTP_INFO1_AUDADC_B1_LG_OFFSET_LGOFFSET_Pos 0
#define AM_REG_OTP_INFO1_AUDADC_B1_LG_OFFSET_LGOFFSET_Msk 0xFFFFFFFF

// AUDADC_B1_HG_SLOPE - This is the float value for high gain slope (more than 12dB). B1 maps to Slot 3
#define AM_REG_OTP_INFO1_AUDADC_B1_HG_SLOPE_HGSLOPE_S 0
#define AM_REG_OTP_INFO1_AUDADC_B1_HG_SLOPE_HGSLOPE_M 0xFFFFFFFF
#define AM_REG_OTP_INFO1_AUDADC_B1_HG_SLOPE_HGSLOPE(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)
#define AM_REG_OTP_INFO1_AUDADC_B1_HG_SLOPE_HGSLOPE_Pos 0
#define AM_REG_OTP_INFO1_AUDADC_B1_HG_SLOPE_HGSLOPE_Msk 0xFFFFFFFF

// AUDADC_B1_HG_INTERCEPT - This is the float value for high gain intercept (more than 12dB). B1 maps to Slot 3
#define AM_REG_OTP_INFO1_AUDADC_B1_HG_INTERCEPT_HGINTERCEPT_S 0
#define AM_REG_OTP_INFO1_AUDADC_B1_HG_INTERCEPT_HGINTERCEPT_M 0xFFFFFFFF
#define AM_REG_OTP_INFO1_AUDADC_B1_HG_INTERCEPT_HGINTERCEPT(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)
#define AM_REG_OTP_INFO1_AUDADC_B1_HG_INTERCEPT_HGINTERCEPT_Pos 0
#define AM_REG_OTP_INFO1_AUDADC_B1_HG_INTERCEPT_HGINTERCEPT_Msk 0xFFFFFFFF

// RFTRIM_TRIM_VER - Radio trim version
#define AM_REG_OTP_INFO1_RFTRIM_TRIM_VER_VERSION_S 0
#define AM_REG_OTP_INFO1_RFTRIM_TRIM_VER_VERSION_M 0xFFFFFFFF
#define AM_REG_OTP_INFO1_RFTRIM_TRIM_VER_VERSION(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)
#define AM_REG_OTP_INFO1_RFTRIM_TRIM_VER_VERSION_Pos 0
#define AM_REG_OTP_INFO1_RFTRIM_TRIM_VER_VERSION_Msk 0xFFFFFFFF

// RFTRIM_XOCONFIG - RF trim XO configuration
#define AM_REG_OTP_INFO1_RFTRIM_XOCONFIG_CFG_S 0
#define AM_REG_OTP_INFO1_RFTRIM_XOCONFIG_CFG_M 0xFFFFFFFF
#define AM_REG_OTP_INFO1_RFTRIM_XOCONFIG_CFG(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)
#define AM_REG_OTP_INFO1_RFTRIM_XOCONFIG_CFG_Pos 0
#define AM_REG_OTP_INFO1_RFTRIM_XOCONFIG_CFG_Msk 0xFFFFFFFF

// RFTRIM_OSCTRIM - RF trim oscillator trim
#define AM_REG_OTP_INFO1_RFTRIM_OSCTRIM_TRIM_S 0
#define AM_REG_OTP_INFO1_RFTRIM_OSCTRIM_TRIM_M 0xFFFFFFFF
#define AM_REG_OTP_INFO1_RFTRIM_OSCTRIM_TRIM(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)
#define AM_REG_OTP_INFO1_RFTRIM_OSCTRIM_TRIM_Pos 0
#define AM_REG_OTP_INFO1_RFTRIM_OSCTRIM_TRIM_Msk 0xFFFFFFFF

// RFTRIM_RADIOTUNE - Radio trim radio tune value
#define AM_REG_OTP_INFO1_RFTRIM_RADIOTUNE_TRIM_S 0
#define AM_REG_OTP_INFO1_RFTRIM_RADIOTUNE_TRIM_M 0xFFFFFFFF
#define AM_REG_OTP_INFO1_RFTRIM_RADIOTUNE_TRIM(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)
#define AM_REG_OTP_INFO1_RFTRIM_RADIOTUNE_TRIM_Pos 0
#define AM_REG_OTP_INFO1_RFTRIM_RADIOTUNE_TRIM_Msk 0xFFFFFFFF

// POWERSTATE0 - ICY_TX_TOP_PA_LINEARIZE_LUT_0_Coef_14
#define AM_REG_OTP_INFO1_POWERSTATE0_VDDFRXCOMPTRIMMINUS_S 5
#define AM_REG_OTP_INFO1_POWERSTATE0_VDDFRXCOMPTRIMMINUS_M 0x000003E0
#define AM_REG_OTP_INFO1_POWERSTATE0_VDDFRXCOMPTRIMMINUS(n) (((uint32_t)(n) << 5) & 0x000003E0)
#define AM_REG_OTP_INFO1_POWERSTATE0_VDDFRXCOMPTRIMMINUS_Pos 5
#define AM_REG_OTP_INFO1_POWERSTATE0_VDDFRXCOMPTRIMMINUS_Msk 0x000003E0
#define AM_REG_OTP_INFO1_POWERSTATE0_VDDCRXCOMPTRIMMINUS_S 0
#define AM_REG_OTP_INFO1_POWERSTATE0_VDDCRXCOMPTRIMMINUS_M 0x0000001F
#define AM_REG_OTP_INFO1_POWERSTATE0_VDDCRXCOMPTRIMMINUS(n) (((uint32_t)(n) << 0) & 0x0000001F)
#define AM_REG_OTP_INFO1_POWERSTATE0_VDDCRXCOMPTRIMMINUS_Pos 0
#define AM_REG_OTP_INFO1_POWERSTATE0_VDDCRXCOMPTRIMMINUS_Msk 0x0000001F

// SCM_CNTRCTRL2 - SCM controller control 2
#define AM_REG_OTP_INFO1_SCM_CNTRCTRL2_FCNT2_S 16
#define AM_REG_OTP_INFO1_SCM_CNTRCTRL2_FCNT2_M 0xFFFF0000
#define AM_REG_OTP_INFO1_SCM_CNTRCTRL2_FCNT2(n) (((uint32_t)(n) << 16) & 0xFFFF0000)
#define AM_REG_OTP_INFO1_SCM_CNTRCTRL2_FCNT2_Pos 16
#define AM_REG_OTP_INFO1_SCM_CNTRCTRL2_FCNT2_Msk 0xFFFF0000
#define AM_REG_OTP_INFO1_SCM_CNTRCTRL2_FCNT1_S 0
#define AM_REG_OTP_INFO1_SCM_CNTRCTRL2_FCNT1_M 0x0000FFFF
#define AM_REG_OTP_INFO1_SCM_CNTRCTRL2_FCNT1(n) (((uint32_t)(n) << 0) & 0x0000FFFF)
#define AM_REG_OTP_INFO1_SCM_CNTRCTRL2_FCNT1_Pos 0
#define AM_REG_OTP_INFO1_SCM_CNTRCTRL2_FCNT1_Msk 0x0000FFFF

// SCM_LPTHRESHVDDS - SCM low power VDDS threshold
#define AM_REG_OTP_INFO1_SCM_LPTHRESHVDDS_LPTHRESHVDDS_S 0
#define AM_REG_OTP_INFO1_SCM_LPTHRESHVDDS_LPTHRESHVDDS_M 0x000FFFFF
#define AM_REG_OTP_INFO1_SCM_LPTHRESHVDDS_LPTHRESHVDDS(n) (((uint32_t)(n) << 0) & 0x000FFFFF)
#define AM_REG_OTP_INFO1_SCM_LPTHRESHVDDS_LPTHRESHVDDS_Pos 0
#define AM_REG_OTP_INFO1_SCM_LPTHRESHVDDS_LPTHRESHVDDS_Msk 0x000FFFFF

// SCM_LPTHRESHVDDF - SCM low power VDDF threshold
#define AM_REG_OTP_INFO1_SCM_LPTHRESHVDDF_LPTHRESHVDDF_S 0
#define AM_REG_OTP_INFO1_SCM_LPTHRESHVDDF_LPTHRESHVDDF_M 0x000FFFFF
#define AM_REG_OTP_INFO1_SCM_LPTHRESHVDDF_LPTHRESHVDDF(n) (((uint32_t)(n) << 0) & 0x000FFFFF)
#define AM_REG_OTP_INFO1_SCM_LPTHRESHVDDF_LPTHRESHVDDF_Pos 0
#define AM_REG_OTP_INFO1_SCM_LPTHRESHVDDF_LPTHRESHVDDF_Msk 0x000FFFFF

