AmbiqAI/neuralSPOT/extern/AmbiqSuite/R5.2.alpha.1.1/mcu/apollo510L/regs/am_mcu_apollo510L_otpinfo1.h
// SCM_LPTHRESHVDDC - SCM low power VDDC threshold
#define AM_REG_OTP_INFO1_SCM_LPTHRESHVDDC_LPTHRESHVDDC_S 0
#define AM_REG_OTP_INFO1_SCM_LPTHRESHVDDC_LPTHRESHVDDC_M 0x000FFFFF
#define AM_REG_OTP_INFO1_SCM_LPTHRESHVDDC_LPTHRESHVDDC(n) (((uint32_t)(n) << 0) & 0x000FFFFF)
#define AM_REG_OTP_INFO1_SCM_LPTHRESHVDDC_LPTHRESHVDDC_Pos 0
#define AM_REG_OTP_INFO1_SCM_LPTHRESHVDDC_LPTHRESHVDDC_Msk 0x000FFFFF

// SCM_LPTHRESHVDDCLV - SCM low power VDDCLV threshold
#define AM_REG_OTP_INFO1_SCM_LPTHRESHVDDCLV_LPTHRESHVDDCLV_S 0
#define AM_REG_OTP_INFO1_SCM_LPTHRESHVDDCLV_LPTHRESHVDDCLV_M 0x000FFFFF
#define AM_REG_OTP_INFO1_SCM_LPTHRESHVDDCLV_LPTHRESHVDDCLV(n) (((uint32_t)(n) << 0) & 0x000FFFFF)
#define AM_REG_OTP_INFO1_SCM_LPTHRESHVDDCLV_LPTHRESHVDDCLV_Pos 0
#define AM_REG_OTP_INFO1_SCM_LPTHRESHVDDCLV_LPTHRESHVDDCLV_Msk 0x000FFFFF

// SCM_LPTHRESHVDDRF - SCM low power VDDRF threshold
#define AM_REG_OTP_INFO1_SCM_LPTHRESHVDDRF_LPTHRESHVDDRF_S 0
#define AM_REG_OTP_INFO1_SCM_LPTHRESHVDDRF_LPTHRESHVDDRF_M 0x000FFFFF
#define AM_REG_OTP_INFO1_SCM_LPTHRESHVDDRF_LPTHRESHVDDRF(n) (((uint32_t)(n) << 0) & 0x000FFFFF)
#define AM_REG_OTP_INFO1_SCM_LPTHRESHVDDRF_LPTHRESHVDDRF_Pos 0
#define AM_REG_OTP_INFO1_SCM_LPTHRESHVDDRF_LPTHRESHVDDRF_Msk 0x000FFFFF

// SCM_LPHYSTCNT - SCM low power hyst count
#define AM_REG_OTP_INFO1_SCM_LPHYSTCNT_LPHYSTCNT_S 0
#define AM_REG_OTP_INFO1_SCM_LPHYSTCNT_LPHYSTCNT_M 0x000FFFFF
#define AM_REG_OTP_INFO1_SCM_LPHYSTCNT_LPHYSTCNT(n) (((uint32_t)(n) << 0) & 0x000FFFFF)
#define AM_REG_OTP_INFO1_SCM_LPHYSTCNT_LPHYSTCNT_Pos 0
#define AM_REG_OTP_INFO1_SCM_LPHYSTCNT_LPHYSTCNT_Msk 0x000FFFFF

// SCM_ACTTHRESH1 - SCM active threshold
#define AM_REG_OTP_INFO1_SCM_ACTTHRESH1_ACTTHRESHVDDS_S 16
#define AM_REG_OTP_INFO1_SCM_ACTTHRESH1_ACTTHRESHVDDS_M 0xFFFF0000
#define AM_REG_OTP_INFO1_SCM_ACTTHRESH1_ACTTHRESHVDDS(n) (((uint32_t)(n) << 16) & 0xFFFF0000)
#define AM_REG_OTP_INFO1_SCM_ACTTHRESH1_ACTTHRESHVDDS_Pos 16
#define AM_REG_OTP_INFO1_SCM_ACTTHRESH1_ACTTHRESHVDDS_Msk 0xFFFF0000
#define AM_REG_OTP_INFO1_SCM_ACTTHRESH1_ACTTHRESHVDDF_S 0
#define AM_REG_OTP_INFO1_SCM_ACTTHRESH1_ACTTHRESHVDDF_M 0x0000FFFF
#define AM_REG_OTP_INFO1_SCM_ACTTHRESH1_ACTTHRESHVDDF(n) (((uint32_t)(n) << 0) & 0x0000FFFF)
#define AM_REG_OTP_INFO1_SCM_ACTTHRESH1_ACTTHRESHVDDF_Pos 0
#define AM_REG_OTP_INFO1_SCM_ACTTHRESH1_ACTTHRESHVDDF_Msk 0x0000FFFF

// SCM_ACTTHRESH2 - SCM active threshold
#define AM_REG_OTP_INFO1_SCM_ACTTHRESH2_ACTTHRESHVDDC_S 16
#define AM_REG_OTP_INFO1_SCM_ACTTHRESH2_ACTTHRESHVDDC_M 0xFFFF0000
#define AM_REG_OTP_INFO1_SCM_ACTTHRESH2_ACTTHRESHVDDC(n) (((uint32_t)(n) << 16) & 0xFFFF0000)
#define AM_REG_OTP_INFO1_SCM_ACTTHRESH2_ACTTHRESHVDDC_Pos 16
#define AM_REG_OTP_INFO1_SCM_ACTTHRESH2_ACTTHRESHVDDC_Msk 0xFFFF0000
#define AM_REG_OTP_INFO1_SCM_ACTTHRESH2_ACTTHRESHVDDCLV_S 0
#define AM_REG_OTP_INFO1_SCM_ACTTHRESH2_ACTTHRESHVDDCLV_M 0x0000FFFF
#define AM_REG_OTP_INFO1_SCM_ACTTHRESH2_ACTTHRESHVDDCLV(n) (((uint32_t)(n) << 0) & 0x0000FFFF)
#define AM_REG_OTP_INFO1_SCM_ACTTHRESH2_ACTTHRESHVDDCLV_Pos 0
#define AM_REG_OTP_INFO1_SCM_ACTTHRESH2_ACTTHRESHVDDCLV_Msk 0x0000FFFF

// SCM_ACTTHRESH3 - SCM active threshold
#define AM_REG_OTP_INFO1_SCM_ACTTHRESH3_ACTTHRESHVDDRF_S 0
#define AM_REG_OTP_INFO1_SCM_ACTTHRESH3_ACTTHRESHVDDRF_M 0x0000FFFF
#define AM_REG_OTP_INFO1_SCM_ACTTHRESH3_ACTTHRESHVDDRF(n) (((uint32_t)(n) << 0) & 0x0000FFFF)
#define AM_REG_OTP_INFO1_SCM_ACTTHRESH3_ACTTHRESHVDDRF_Pos 0
#define AM_REG_OTP_INFO1_SCM_ACTTHRESH3_ACTTHRESHVDDRF_Msk 0x0000FFFF

#endif
